Repository: 84000/data-translation-memory
Catalog: toh342_84000-the-questions-of-dirghanakha-the-wandering-mendicant.tmx
Source language: bo
Languages: en

source: ཀུན་ཏུ་རྒྱུ་བ་སེན་རིངས་ཀྱིས་ཞུས་པ་ཞེས་བྱ་བའི་མདོ།
en: The Questions of Dīrghanakha the Wandering Mendicant

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: The Blessed One was dwelling in Rājagṛha on Vulture Peak Mountain together with a great monastic saṅgha of 1,250 monks.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བཞི་པོ་དག་ལ་ཆོས་སྟོན་ཏེ། ཚངས་པར་སྤྱོད་པ།
en: Then the Blessed One taught the Dharma to the fourfold saṅgha.

source: ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ།
en: He taught the wholesome conduct that is virtuous in the beginning, virtuous in the middle, and virtuous in the end, and that is excellent in meaning, excellent in words, distinctive, perfect, completely pure, and completely refined.

source: ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །དེའི་ཚེ་ཀུན་ཏུ་རྒྱུ་སེན་རིངས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time Dīrghanakha the wandering mendicant journeyed to where the Blessed One was.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར། ཁར་བ་ལ་ཨོམ་ཚུགས་བཅས་ཏེ་ཅང་མི་སྨྲ་བར་འདུག་ནས་བལྟས་ཏེ།
en: Arriving in the presence of the Blessed One, he stood there resting on his staff, saying nothing at all.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཀྱེ་གོའུ་ཏ་མ་འཇིག་རྟེན་ནི་ལས་བདག་གིར་བྱ་བ། ལས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པ། ལས་ཀྱི་འཆིང་བ་ཅན་ལས་བརྟན་པར་བྱའོ་ཞེས་དེ་སྐད་སྨྲས་པ་ནི་བདེན་ན། དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་རྡོ་རྗེའི་ལུས་དང་ལྡན་པར་གྱུར།
en: He then looked up and said to the Blessed One, “Hey, Gautama, you say that beings of the world take possession of actions, enjoy the legacy of actions, and are bound by the fetters of actions, and you say that these actions are reliable. If this is true, then (1) what previous actions has the renunciant Gautama performed and accumulated so that he has come to possess the vajra body?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་སྲོག་གཅོད་པ་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning killing in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏམ་སོར་མོ་རིང་ཞིང་སོར་མོའི་བར་དྲ་བས་འབྲེལ་པར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he came to have fingers that are long and webbed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་ལེན་པ་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning taking what is not given in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་དབང་པོ་ཡོངས་སུ་ཚང་ཞིང་ལུས་རབ་ཏུ་རྒྱས་པར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he came to have complete faculties and a fully developed body?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning desire and sexual misconduct in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་ལྕེས་གདོང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཁེབས།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he came to have a tongue that covers the entire circle of his face?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning false speech in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་སེང་གེའི་སྟབས་སུ་འགྲོ་བར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he came to have the gait of a lion?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་འབྲུའི་ཆང་དང་། སྦྱར་བའི་ཆང་མྱོས་པ་བག་མེད་པའི་གནས་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ། །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning the state of heedlessness induced from being intoxicated with beer or other alcohol in my previous succession of lives.”

source: དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་སོ་བཞི་བཅུ་དང་ལྡན་ཞིང་སོ་མཉམ་ལ་སོ་དཀར་བར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he came to possess forty even and white teeth?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་དུས་མ་ཡིན་པའི་ཟས་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning eating food at inappropriate times in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་ཚུལ་ཁྲིམས་ཀྱི་སྤོས་ཀྱིས་ལུས་བྱུགས་པར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he manifested a body anointed with the fragrance of moral discipline?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཁ་དོག་འཆང་བ་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ། །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning the wearing of garlands, perfumes, ointments, and cosmetics in my previous succession of lives.”

source: དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་ལུས་མཚན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that his body came to be adorned with all of the signs?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་གླུ་དང་གར་དང་། རྒྱན་རྣམས་སྤངས་པས་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning song, dance, and jewelry in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་སྟན་གསུམ་ལ་ཡོངས་སུ་སྤྱོད།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he enjoys the three seats?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར་ཁྲི་སྟན་མཐོན་པོ་དང་། ཁྲི་སྟན་ཆེན་པོ་སྤངས་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the action of abandoning high thrones and large beds in my previous succession of lives.”

source: །དགེ་སྦྱོང་གོའུ་ཏ་མས་སྔོན་ལས་ཅི་ཞིག་བྱས་ཤིང་བསགས་ན། དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་མགོའི་གཙུག་ཏོར་འཕགས་པར་གྱུར།
en: “What previous actions did the renunciant Gautama perform and accumulate so that he came to have the raised uṣṇīṣa on his head?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་ཆེན་པོ་འདི་ནི་ངས་ཚེ་རབས་སྔ་མའི་སྐྱེ་བར། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། ཕ་མ་དང་། སློབ་དཔོན་དང་། མཁན་པོ་དང་། བླ་མ་དང་། སྦྱིན་གནས་རྣམས་ལ་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ་མགོ་བོས་ཕྱག་འཚལ་ལོ། །མཆོད་པའི་ལས་དེའི་འབྲས་བུ་ཡིན་ནོ།
en: The Blessed One replied, “Great brahmin, this is the result of the actions of placing my limbs and head upon the earth, prostrating, and making offerings to the Buddha, Dharma, Saṅgha, parents, preceptors, scholars, gurus, and those worthy of offering in my previous succession of lives.”

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་སེན་རིངས་ཀྱིས་ཁར་བ་ས་ལ་བོར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: At this point, Dīrghanakha the wandering mendicant set his staff on the ground and bowed his head to the feet of the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཇི་སྲིད་འཚོའི་བར་དུ་སངས་རྒྱས་ལ་སྐྱབས་སུ་མཆིའོ།
en: Standing to the side of the Blessed One, he joined his palms together, bowed, and said, “Blessed One, for as long as I live, I go for refuge in the Buddha.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་ཆོས་ལ་སྐྱབས་སུ་མཆིའོ།
en: For as long as I live, I go for refuge in the Dharma.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: For as long as I live, I go for refuge in the Saṅgha.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་ཡན་ལག་བརྒྱད་པའི་བསྙེན་གནས་ལ་ཉེ་བར་གནས་པར་བགྱིའོ།
en: For as long as I live, I will undertake abstinence relating to the eight poṣadha vows.

source: །སྲོག་ཆགས་ཐམས་ཅད་གསོད་དང་གཞན་ནོར་རྐུ་དང་མི་ཚངས་སྤྱོད་པ་དང་། །ངག་གི་དབྱེ་བ་བརྫུན་དང་མྱོས་སྐྱེད་དུས་མིན་ཟ་བ་དང་། །ཕྲེང་བ་ཁ་དོག་གླུ་དང་གར་དང་རྩེ་འཇོ་མལ་སྟན་མཐོན་པོ་རྣམས།
en: “From now on I will abandon (1) killing any living creatures, (2) stealing another’s wealth, (3) engaging in sex, (4) lying or using divisive speech, (5) becoming intoxicated, (6) eating food at the inappropriate time, (7) garlands, cosmetics, song, dance, and entertainment, and (8) high beds.

source: །དེང་ནས་བདག་གིས་སྤངས་ཏེ་ཡོན་ཏན་བརྒྱད་ཀྱིས་དགྲ་བཅོམ་ཚུལ་དུ་བགྱི།
en: I will maintain these eight good qualities in the manner of the arhats.”

source: །དེ་བཞིན་དུ་ལན་གཉིས་ལན་གསུམ་དུའོ། །བདག་གིས་གསོ་སྦྱོང་གི་ཚུལ་ཁྲིམས་ཀྱི་སྡོམ་པ་ཡང་དག་པར་འཛིན་པ་འདི་སེམས་ཀྱི་རྒྱན་དང་། སེམས་ཀྱི་ཡོ་བྱད་དང་། བྱང་ཆུབ་ཀྱི་ཚོགས་སུ་འགྱུར་བ་དང་། དོན་གྱི་དམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་བླ་ན་མེད་པ་ལ་གནས་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: In the same way, he repeated this vow a second and third time and said, “I will correctly maintain the vows of the discipline of the poṣadha. This will be the ornament of my mind, the instrument of my mind, and the accumulation of awakening. May I remain in the omniscient wisdom of the ultimate truth and the unsurpassable bliss of nirvāṇa.”

source: བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་དེ་ལྟར་བྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One said, “Great brahmin, you should do just that! Excellent! Excellent!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།།
en: When the Blessed One had thus spoken, those monks and the world with its gods, humans, demigods, and gandharvas rejoiced and praised the words of the Blessed One.
